---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.IsToOtherRebar
source: html/e47bd358-176e-f4fa-40b4-43f1d6c0f4ba.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.IsToOtherRebar Method

Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar.'

## Syntax (C#)
```csharp
public bool IsToOtherRebar()
```